resilencelyn/gitee/open-skyeye/code/device/gpioSimulateDevice/gpio_f28335/gpio_f28335.h
/* Copyright (C) 
* 2011 - Michael.Kang blackfin.kang@gmail.com
* This program is free software; you can redistribute it and/or
* modify it under the terms of the GNU General Public License
* as published by the Free Software Foundation; either version 2
* of the License, or (at your option) any later version.
* 
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
* 
* You should have received a copy of the GNU General Public License
* along with this program; if not, write to the Free Software
* Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
* 
*/
/**
* @file gpio_f28335.h
* @brief The definition of system controller for f28335
* @author Michael.Kang blackfin.kang@gmail.com
* @version 78.77
* @date 2011-12-12
*/

#ifndef __SYSCTRL_F28335_H__
#define __SYSCTRL_F28335_H__

//----------------------------------------------------
// GPIO A control register bit definitions */
struct GPACTRL_BITS {        // bits   description
   uint16_t QUALPRD0:8;        // 7:0    Qual period
   uint16_t QUALPRD1:8;        // 15:8   Qual period
   uint16_t QUALPRD2:8;        // 23:16  Qual period
   uint16_t QUALPRD3:8;        // 31:24  Qual period
};

union GPACTRL_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPA_LSB;
			uint16_t GPA_MSB;
		};
	};
   struct GPACTRL_BITS bit;
};

//----------------------------------------------------
// GPIO B control register bit definitions */
struct GPBCTRL_BITS {        // bits   description
   uint16_t QUALPRD0:8;        // 7:0    Qual period
   uint16_t QUALPRD1:8;        // 15:8   Qual period
   uint16_t QUALPRD2:8;        // 23:16  Qual period
   uint16_t QUALPRD3:8;        // 31:24
};

union GPBCTRL_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPB_LSB;
			uint16_t GPB_MSB;
		};
	};
   struct GPBCTRL_BITS bit;
};

//----------------------------------------------------
// GPIO A Qual/MUX select register bit definitions */
struct GPA1_BITS {            // bits   description
   uint16_t GPIO0:2;            // 1:0    GPIO0
   uint16_t GPIO1:2;            // 3:2    GPIO1
   uint16_t GPIO2:2;            // 5:4    GPIO2
   uint16_t GPIO3:2;            // 7:6    GPIO3
   uint16_t GPIO4:2;            // 9:8    GPIO4
   uint16_t GPIO5:2;            // 11:10  GPIO5
   uint16_t GPIO6:2;            // 13:12  GPIO6
   uint16_t GPIO7:2;            // 15:14  GPIO7
   uint16_t GPIO8:2;            // 17:16  GPIO8
   uint16_t GPIO9:2;            // 19:18  GPIO9
   uint16_t GPIO10:2;           // 21:20  GPIO10
   uint16_t GPIO11:2;           // 23:22  GPIO11
   uint16_t GPIO12:2;           // 25:24  GPIO12
   uint16_t GPIO13:2;           // 27:26  GPIO13
   uint16_t GPIO14:2;           // 29:28  GPIO14
   uint16_t GPIO15:2;           // 31:30  GPIO15
};


struct GPA2_BITS {            // bits   description
   uint16_t GPIO16:2;           // 1:0    GPIO16
   uint16_t GPIO17:2;           // 3:2    GPIO17
   uint16_t GPIO18:2;           // 5:4    GPIO18
   uint16_t GPIO19:2;           // 7:6    GPIO19
   uint16_t GPIO20:2;           // 9:8    GPIO20
   uint16_t GPIO21:2;           // 11:10  GPIO21
   uint16_t GPIO22:2;           // 13:12  GPIO22
   uint16_t GPIO23:2;           // 15:14  GPIO23
   uint16_t GPIO24:2;           // 17:16  GPIO24
   uint16_t GPIO25:2;           // 19:18  GPIO25
   uint16_t GPIO26:2;           // 21:20  GPIO26
   uint16_t GPIO27:2;           // 23:22  GPIO27
   uint16_t GPIO28:2;           // 25:24  GPIO28
   uint16_t GPIO29:2;           // 27:26  GPIO29
   uint16_t GPIO30:2;           // 29:28  GPIO30
   uint16_t GPIO31:2;           // 31:30  GPIO31
};

struct GPB1_BITS {            // bits   description
   uint16_t GPIO32:2;           // 1:0    GPIO32
   uint16_t GPIO33:2;           // 3:2    GPIO33
   uint16_t GPIO34:2;           // 5:4    GPIO34
   uint16_t GPIO35:2;           // 7:6    GPIO35
   uint16_t GPIO36:2;           // 9:8    GPIO36
   uint16_t GPIO37:2;           // 11:10  GPIO37
   uint16_t GPIO38:2;           // 13:12  GPIO38
   uint16_t GPIO39:2;           // 15:14  GPIO39
   uint16_t GPIO40:2;           // 17:16  GPIO40
   uint16_t GPIO41:2;           // 19:16  GPIO41
   uint16_t GPIO42:2;           // 21:20  GPIO42
   uint16_t GPIO43:2;           // 23:22  GPIO43
   uint16_t GPIO44:2;           // 25:24  GPIO44
   uint16_t GPIO45:2;           // 27:26  GPIO45
   uint16_t GPIO46:2;           // 29:28  GPIO46
   uint16_t GPIO47:2;           // 31:30  GPIO47
};

struct GPB2_BITS  {           // bits   description
   uint16_t GPIO48:2;           // 1:0    GPIO48
   uint16_t GPIO49:2;           // 3:2    GPIO49
   uint16_t GPIO50:2;           // 5:4    GPIO50
   uint16_t GPIO51:2;           // 7:6    GPIO51
   uint16_t GPIO52:2;           // 9:8    GPIO52
   uint16_t GPIO53:2;           // 11:10  GPIO53
   uint16_t GPIO54:2;           // 13:12  GPIO54
   uint16_t GPIO55:2;           // 15:14  GPIO55
   uint16_t GPIO56:2;           // 17:16  GPIO56
   uint16_t GPIO57:2;           // 19:18  GPIO57
   uint16_t GPIO58:2;           // 21:20  GPIO58
   uint16_t GPIO59:2;           // 23:22  GPIO59
   uint16_t GPIO60:2;           // 25:24  GPIO60
   uint16_t GPIO61:2;           // 27:26  GPIO61
   uint16_t GPIO62:2;           // 29:28  GPIO62
   uint16_t GPIO63:2;           // 31:30  GPIO63
};

struct GPC1_BITS {            // bits   description
   uint16_t GPIO64:2;           // 1:0    GPIO64
   uint16_t GPIO65:2;           // 3:2    GPIO65
   uint16_t GPIO66:2;           // 5:4    GPIO66
   uint16_t GPIO67:2;           // 7:6    GPIO67
   uint16_t GPIO68:2;           // 9:8    GPIO68
   uint16_t GPIO69:2;           // 11:10  GPIO69
   uint16_t GPIO70:2;           // 13:12  GPIO70
   uint16_t GPIO71:2;           // 15:14  GPIO71
   uint16_t GPIO72:2;           // 17:16  GPIO72
   uint16_t GPIO73:2;           // 19:18  GPIO73
   uint16_t GPIO74:2;           // 21:20  GPIO74
   uint16_t GPIO75:2;           // 23:22  GPIO75
   uint16_t GPIO76:2;           // 25:24  GPIO76
   uint16_t GPIO77:2;           // 27:26  GPIO77
   uint16_t GPIO78:2;           // 29:28  GPIO78
   uint16_t GPIO79:2;           // 31:30  GPIO79
};


