resilencelyn/gitee/open-skyeye/code/device/gpioSimulateDevice/gpio_f28335/gpio_f28335.h
struct GPC2_BITS {            // bits   description
   uint16_t GPIO80:2;           // 1:0    GPIO80
   uint16_t GPIO81:2;           // 3:2    GPIO81
   uint16_t GPIO82:2;           // 5:4    GPIO82
   uint16_t GPIO83:2;           // 7:6    GPIO83
   uint16_t GPIO84:2;           // 9:8    GPIO84
   uint16_t GPIO85:2;           // 11:10  GPIO85
   uint16_t GPIO86:2;           // 13:12  GPIO86
   uint16_t GPIO87:2;           // 15:14  GPIO87
   uint16_t rsvd:16;            // 31:16  reserved
};


union GPA1_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPA1_LSB;
			uint16_t GPA1_MSB;
		};
	};
   struct GPA1_BITS    bit;
};

union GPA2_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPA2_LSB;
			uint16_t GPA2_MSB;
		};
	};
   struct GPA2_BITS    bit;
};

union GPB1_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPB1_LSB;
			uint16_t GPB1_MSB;
		};
	};
   struct GPB1_BITS    bit;
};

union GPB2_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPB2_LSB;
			uint16_t GPB2_MSB;
		};
	};
   struct GPB2_BITS    bit;
};

union GPC1_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPC1_LSB;
			uint16_t GPC1_MSB;
		};
	};
   struct GPC1_BITS    bit;
};

union GPC2_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPC2_LSB;
			uint16_t GPC2_MSB;
		};
	};
   struct GPC2_BITS    bit;
};

//----------------------------------------------------
// GPIO A DIR/TOGGLE/SET/CLEAR register bit definitions */
struct GPADAT_BITS {          // bits   description
   uint16_t GPIO0:1;            // 0      GPIO0
   uint16_t GPIO1:1;            // 1      GPIO1
   uint16_t GPIO2:1;            // 2      GPIO2
   uint16_t GPIO3:1;            // 3      GPIO3
   uint16_t GPIO4:1;            // 4      GPIO4
   uint16_t GPIO5:1;            // 5      GPIO5
   uint16_t GPIO6:1;            // 6      GPIO6
   uint16_t GPIO7:1;            // 7      GPIO7
   uint16_t GPIO8:1;            // 8      GPIO8
   uint16_t GPIO9:1;            // 9      GPIO9
   uint16_t GPIO10:1;           // 10     GPIO10
   uint16_t GPIO11:1;           // 11     GPIO11
   uint16_t GPIO12:1;           // 12     GPIO12
   uint16_t GPIO13:1;           // 13     GPIO13
   uint16_t GPIO14:1;           // 14     GPIO14
   uint16_t GPIO15:1;           // 15     GPIO15
   uint16_t GPIO16:1;           // 16     GPIO16
   uint16_t GPIO17:1;           // 17     GPIO17
   uint16_t GPIO18:1;           // 18     GPIO18
   uint16_t GPIO19:1;           // 19     GPIO19
   uint16_t GPIO20:1;           // 20     GPIO20
   uint16_t GPIO21:1;           // 21     GPIO21
   uint16_t GPIO22:1;           // 22     GPIO22
   uint16_t GPIO23:1;           // 23     GPIO23
   uint16_t GPIO24:1;           // 24     GPIO24
   uint16_t GPIO25:1;           // 25     GPIO25
   uint16_t GPIO26:1;           // 26     GPIO26
   uint16_t GPIO27:1;           // 27     GPIO27
   uint16_t GPIO28:1;           // 28     GPIO28
   uint16_t GPIO29:1;           // 29     GPIO29
   uint16_t GPIO30:1;           // 30     GPIO30
   uint16_t GPIO31:1;           // 31     GPIO31
};

struct GPBDAT_BITS {          // bits   description
   uint16_t GPIO32:1;           // 0      GPIO32
   uint16_t GPIO33:1;           // 1      GPIO33
   uint16_t GPIO34:1;           // 2      GPIO34
   uint16_t GPIO35:1;           // 3      GPIO35
   uint16_t GPIO36:1;           // 4      GPIO36
   uint16_t GPIO37:1;           // 5      GPIO37
   uint16_t GPIO38:1;           // 6      GPIO38
   uint16_t GPIO39:1;           // 7      GPIO39
   uint16_t GPIO40:1;           // 8      GPIO40
   uint16_t GPIO41:1;           // 9      GPIO41
   uint16_t GPIO42:1;           // 10     GPIO42
   uint16_t GPIO43:1;           // 11     GPIO43
   uint16_t GPIO44:1;           // 12     GPIO44
   uint16_t GPIO45:1;           // 13     GPIO45
   uint16_t GPIO46:1;           // 14     GPIO46
   uint16_t GPIO47:1;           // 15     GPIO47
   uint16_t GPIO48:1;           // 16     GPIO48
   uint16_t GPIO49:1;           // 17     GPIO49
   uint16_t GPIO50:1;           // 18     GPIO50
   uint16_t GPIO51:1;           // 19     GPIO51
   uint16_t GPIO52:1;           // 20     GPIO52
   uint16_t GPIO53:1;           // 21     GPIO53
   uint16_t GPIO54:1;           // 22     GPIO54
   uint16_t GPIO55:1;           // 23     GPIO55
   uint16_t GPIO56:1;           // 24     GPIO56
   uint16_t GPIO57:1;           // 25     GPIO57
   uint16_t GPIO58:1;           // 26     GPIO58
   uint16_t GPIO59:1;           // 27     GPIO59
   uint16_t GPIO60:1;           // 28     GPIO60
   uint16_t GPIO61:1;           // 29     GPIO61
   uint16_t GPIO62:1;           // 30     GPIO62
   uint16_t GPIO63:1;           // 31     GPIO63
};

struct GPCDAT_BITS {          // bits   description
   uint16_t GPIO64:1;           // 0      GPIO64
   uint16_t GPIO65:1;           // 1      GPIO65
   uint16_t GPIO66:1;           // 2      GPIO66
   uint16_t GPIO67:1;           // 3      GPIO67
   uint16_t GPIO68:1;           // 4      GPIO68
   uint16_t GPIO69:1;           // 5      GPIO69
   uint16_t GPIO70:1;           // 6      GPIO70
   uint16_t GPIO71:1;           // 7      GPIO71
   uint16_t GPIO72:1;           // 8      GPIO72
   uint16_t GPIO73:1;           // 9      GPIO73
   uint16_t GPIO74:1;           // 10     GPIO74
   uint16_t GPIO75:1;           // 11     GPIO75
   uint16_t GPIO76:1;           // 12     GPIO76
   uint16_t GPIO77:1;           // 13     GPIO77
   uint16_t GPIO78:1;           // 14     GPIO78
   uint16_t GPIO79:1;           // 15     GPIO79
   uint16_t GPIO80:1;           // 16     GPIO80
   uint16_t GPIO81:1;           // 17     GPIO81
   uint16_t GPIO82:1;           // 18     GPIO82
   uint16_t GPIO83:1;           // 19     GPIO83
   uint16_t GPIO84:1;           // 20     GPIO84
   uint16_t GPIO85:1;           // 21     GPIO85
   uint16_t GPIO86:1;           // 22     GPIO86
   uint16_t GPIO87:1;           // 23     GPIO87
   uint16_t rsvd1:8;            // 31:24  reserved
};


union GPADAT_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPA_LSB;
			uint16_t GPA_MSB;
		};
	};
   struct GPADAT_BITS  bit;
};

union GPBDAT_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPB_LSB;
			uint16_t GPB_MSB;
		};
	};
   struct GPBDAT_BITS  bit;
};

