resilencelyn/gitee/open-skyeye/code/device/gpioSimulateDevice/gpio_f28335/gpio_f28335.h
union GPCDAT_REG {
	union{
   		uint32_t              all;
		struct {
			uint16_t GPC_LSB;
			uint16_t GPC_MSB;
		};
	};
   struct GPCDAT_BITS  bit;
};

//----------------------------------------------------
// GPIO Xint1/XINT2/XNMI select register bit definitions */
struct GPIOXINT_BITS {        // bits   description
    uint16_t GPIOSEL:5;         // 4:0    Select GPIO interrupt input source
    uint16_t rsvd1:11;          // 15:5   reserved
};

union GPIOXINT_REG {
   uint16_t                all;
   struct GPIOXINT_BITS  bit;
};


typedef struct GPIO_REGS {
   union  GPACTRL_REG  GPACTRL;   // GPIO A Control Register (GPIO0 to 31)
   union  GPA1_REG     GPAQSEL1;  // GPIO A Qualifier Select 1 Register (GPIO0 to 15)
   union  GPA2_REG     GPAQSEL2;  // GPIO A Qualifier Select 2 Register (GPIO16 to 31)
   union  GPA1_REG     GPAMUX1;   // GPIO A Mux 1 Register (GPIO0 to 15)
   union  GPA2_REG     GPAMUX2;   // GPIO A Mux 2 Register (GPIO16 to 31)
   union  GPADAT_REG   GPADIR;    // GPIO A Direction Register (GPIO0 to 31)
   union  GPADAT_REG   GPAPUD;    // GPIO A Pull Up Disable Register (GPIO0 to 31)
   union  GPBCTRL_REG  GPBCTRL;   // GPIO B Control Register (GPIO32 to 63)
   union  GPB1_REG     GPBQSEL1;  // GPIO B Qualifier Select 1 Register (GPIO32 to 47)
   union  GPB2_REG     GPBQSEL2;  // GPIO B Qualifier Select 2 Register (GPIO48 to 63)
   union  GPB1_REG     GPBMUX1;   // GPIO B Mux 1 Register (GPIO32 to 47)
   union  GPB2_REG     GPBMUX2;   // GPIO B Mux 2 Register (GPIO48 to 63)
   union  GPBDAT_REG   GPBDIR;    // GPIO B Direction Register (GPIO32 to 63)
   union  GPBDAT_REG   GPBPUD;    // GPIO B Pull Up Disable Register (GPIO32 to 63)
   union  GPC1_REG     GPCMUX1;   // GPIO C Mux 1 Register (GPIO64 to 79)
   union  GPC2_REG     GPCMUX2;   // GPIO C Mux 2 Register (GPIO80 to 95)
   union  GPCDAT_REG   GPCDIR;    // GPIO C Direction Register (GPIO64 to 95)
   union  GPCDAT_REG   GPCPUD;    // GPIO C Pull Up Disable Register (GPIO64 to 95)
   union  GPADAT_REG   GPADAT;       // GPIO Data Register (GPIO0 to 31)
   union  GPADAT_REG   GPASET;       // GPIO Data Set Register (GPIO0 to 31)
   union  GPADAT_REG   GPACLEAR;     // GPIO Data Clear Register (GPIO0 to 31)
   union  GPADAT_REG   GPATOGGLE;    // GPIO Data Toggle Register (GPIO0 to 31)
   union  GPBDAT_REG   GPBDAT;       // GPIO Data Register (GPIO32 to 63)
   union  GPBDAT_REG   GPBSET;       // GPIO Data Set Register (GPIO32 to 63)
   union  GPBDAT_REG   GPBCLEAR;     // GPIO Data Clear Register (GPIO32 to 63)
   union  GPBDAT_REG   GPBTOGGLE;    // GPIO Data Toggle Register (GPIO32 to 63)
   union  GPCDAT_REG   GPCDAT;       // GPIO Data Register (GPIO64 to 95)
   union  GPCDAT_REG   GPCSET;       // GPIO Data Set Register (GPIO64 to 95)
   union  GPCDAT_REG   GPCCLEAR;     // GPIO Data Clear Register (GPIO64 to 95)
   union  GPCDAT_REG   GPCTOGGLE;    // GPIO Data Toggle Register (GPIO64 to 95)
   union  GPIOXINT_REG   GPIOXINT1SEL; // XINT1 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXINT2SEL; // XINT2 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXNMISEL;  // XNMI_Xint13 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXINT3SEL; // XINT3 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXINT4SEL; // XINT4 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXINT5SEL; // XINT5 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXINT6SEL; // XINT6 GPIO Input Selection
   union  GPIOXINT_REG   GPIOXINT7SEL; // XINT7 GPIO Input Selection
   union  GPADAT_REG     GPIOLPMSEL;   // Low power modes GP I/O input select
}gpio_reg_t;
static char* regs_name[] = {
	"GPACTRL_LOW",
	"GPACTRL_HIGH",
	"GPAQSEL1_LOW",
	"GPAQSEL1_HIGH",
	"GPAQSEL2_LOW",
	"GPAQSEL2_HIGH",
	"GPAMUX1_LOW",
	"GPAMUX1_HIGH",
	"GPAMUX2_LOW",
	"GPAMUX2_HIGH",
	"GPADIR_LOW",
	"GPADIR_HIGH",
	"GPAPUD_LOW",
	"GPAPUD_HIGH",
	"GPBCTRL_LOW",    //0x6f90
	"GPBCTRL_HIGH",    //0x6f90
	"GPBQSEL1_LOW",
	"GPBQSEL1_HIGH",
	"GPBQSEL2_LOW",
	"GPBQSEL2_HIGH",
	"GPBMUX1_LOW",
	"GPBMUX1_HIGH",
	"GPBMUX2_LOW",
	"GPBMUX2_HIGH",
	"GPBDIR_LOW",
	"GPBDIR_HIGH",
	"GPBPUD_LOW",
	"GPBPUD_HIGH",

	"GPCMUX1_LOW",   
	"GPCMUX1_HIGH",   
	"GPCMUX2_LOW",
	"GPCMUX2_HIGH",
	"GPCDIR_LOW",
	"GPCDIR_HIGH",
	"GPCPUD_LOW",
	"GPCPUD_HIGH",
	"GPADAT_LOW",    
	"GPADAT_HIGH",    
	"GPASET_LOW",
	"GPASET_HIGH",
	"GPACLEAR_LOW",
	"GPACLEAR_HIGH",
	"GPATOGGLE_LOW",
	"GPATOGGLE_HIGH",

	"GPBDAT_LOW",
	"GPBDAT_HIGH",
	"GPBSET_LOW",
	"GPBSET_HIGH",
	"GPBCLEAR_LOW",
	"GPBCLEAR_HIGH",
	"GPBTOGGLE_LOW",
	"GPBTOGGLE_HIGH",

	"GPCDAT_LOW",
	"GPCDAT_HIGH",
	"GPCSET_LOW",
	"GPCSET_HIGH",
	"GPCCLEAR_LOW",
	"GPCCLEAR_HIGH",
	"GPCTOGGLE_LOW",
	"GPCTOGGLE_HIGH",

	"GPIOXINT1",   
	"GPIOXINT2",   
	"GPIOXNMI",
	"GPIOXINT3",   
	"GPIOXINT4",   
	"GPIOXINT5",   
	"GPIOXINT6",   
	"GPIOXINT7",   
	"GPIOLPM",   
	NULL
};
#define MAX_DEVICE_NUM 38

#define MAX_GPIO_NUM 88
typedef struct {
	int high_pin;
	int low_pin;
	int mode;
	int wake_up;
}gpio_group_t;

typedef struct{
	gpio_connect_device_intf* connector_device_iface;
	conf_object_t* dev;
}gpio_connect_dev_t;

typedef struct{
	gpio_connect_dev_t device[MAX_DEVICE_NUM];
	int dev_num;
}gpio_connect_dev_list_t;

typedef struct f28335_gpio_device{
	conf_object_t* obj;
	gpio_reg_t* regs;
	conf_object_t* gpio_connector;
	skyeye_gpio_connector_intf* connector_iface; 

	general_signal_intf *signal_iface;
	conf_object_t* signal;

	gpio_connect_dev_list_t dev_list;
	conf_object_t *gpio_gate_a;
	skyeye_gate_a_intf *gate_a_iface;
	conf_object_t *gpio_gate_b;
	skyeye_gate_b_intf *gate_b_iface;

	gpio_group_t gpio_group[MAX_GPIO_NUM];
	char channel[8];
	int cnt;
	char** regs_name;
	uint32_t pin_num;
	char *circuit_display;
	RWLOCK_T lock;

	conf_object_t* gpio_link;
    	gpio_linker_pin_intf* gpio_linker_intf;
	char *connect_list;
    	int connect_quanaity;
    	int connect_pin[128];
}f28335_gpio_device;

#define HIGH 1
#define LOW  0

#define OUTPUT_MODE 1
#define INPUT_MODE  0

static uint32_t regs_offset[] = {
	0x0000,
	0x0001,
	0x0002,
	0x0003,
	0x0004,
	0x0005,
	0x0006,
	0x0007,
	0x0008,
	0x0009,
	0x000a,
	0x000b,
	0x000c,
	0x000d,
	0x0010,
	0x0011,
	0x0012,
	0x0013,
	0x0014,
	0x0015,
	0x0016,
	0x0017,
	0x0018,
	0x0019,
	0x001a,
	0x001b,
	0x001c,
	0x001d,
	0x0026,
	0x0027,
	0x0028,
	0x0029,
	0x002a,
	0x002b,
	0x002c,
	0x002d,
	0x0040,
	0x0041,
	0x0042,
	0x0043,
	0x0044,
	0x0045,
	0x0046,
	0x0047,
	0x0048,
	0x0049,
	0x004a,
	0x004b,
	0x004c,
	0x004d,
	0x004e,
	0x004f,
	0x0050,
	0x0051,
	0x0052,
	0x0053,
	0x0054,
	0x0055,
	0x0056,
	0x0057,
	0x0060,
	0x0061,
	0x0062,
	0x0063,
	0x0064,
	0x0065,
	0x0066,
	0x0067,
	0x0068,
	
