resilencelyn/gitee/open-skyeye/code/device/gpioSimulateDevice/gpio_f28335/gpio_f28335.h
};
#define GPA_SET_LOW     0x42	
#define GPA_SET_HIGH    0x43	
#define GPA_CLEAR_LOW 	0x44
#define GPA_CLEAR_HIGH 	0x45
#define GPA_TOGGLE_LOW  0x46	
#define GPA_TOGGLE_HIGH 0x47	
#define GPB_SET_LOW 	0x4a
#define GPB_SET_HIGH 	0x4b
#define GPB_CLEAR_LOW 	0x4c
#define GPB_CLEAR_HIGH 	0x4d
#define GPB_TOGGLE_LOW 	0x4e
#define GPB_TOGGLE_HIGH 0x4f
#define GPC_SET_LOW 	0x52
#define GPC_SET_HIGH 	0x53
#define GPC_CLEAR_LOW 	0x54
#define GPC_CLEAR_HIGH 	0x55
#define GPC_TOGGLE_LOW  0x56	
#define GPC_TOGGLE_HIGH 0x57	

#define REG_NUM 69

//----------------------------------------------------
//
#define GPIOA(ptr, REG, index) \
	{ \
		switch(index) \
		{ \
			case 0: \
				(*ptr) = regs->REG.bit.GPIO0; \
				break; \
			case 1: \
				(*ptr) = regs->REG.bit.GPIO1; \
				break; \
			case 2: \
				(*ptr) = regs->REG.bit.GPIO2; \
				break; \
			case 3: \
				(*ptr) = regs->REG.bit.GPIO3; \
				break; \
			case 4: \
				(*ptr) = regs->REG.bit.GPIO4; \
				break; \
			case 5: \
				(*ptr) = regs->REG.bit.GPIO5; \
				break; \
			case 6: \
				(*ptr) = regs->REG.bit.GPIO6; \
				break; \
			case 7: \
				(*ptr) = regs->REG.bit.GPIO7; \
				break; \
			case 8: \
				(*ptr) = regs->REG.bit.GPIO8; \
				break; \
			case 9: \
				(*ptr) = regs->REG.bit.GPIO9; \
				break; \
			case 10: \
				(*ptr) = regs->REG.bit.GPIO10; \
				break; \
			case 11: \
				(*ptr) = regs->REG.bit.GPIO11; \
				break; \
			case 12: \
				(*ptr) = regs->REG.bit.GPIO12; \
				break; \
			case 13: \
				(*ptr) = regs->REG.bit.GPIO13; \
				break; \
			case 14: \
				(*ptr) = regs->REG.bit.GPIO14; \
				break; \
			case 15: \
				(*ptr) = regs->REG.bit.GPIO15; \
				break; \
			case 16: \
				(*ptr) = regs->REG.bit.GPIO16; \
				break; \
			case 17: \
				(*ptr) = regs->REG.bit.GPIO17; \
				break; \
			case 18: \
				(*ptr) = regs->REG.bit.GPIO18; \
				break; \
			case 19: \
				(*ptr) = regs->REG.bit.GPIO19; \
				break; \
			case 20: \
				(*ptr) = regs->REG.bit.GPIO20; \
				break; \
			case 21: \
				(*ptr) = regs->REG.bit.GPIO21; \
				break; \
			case 22: \
				(*ptr) = regs->REG.bit.GPIO22; \
				break; \
			case 23: \
				(*ptr) = regs->REG.bit.GPIO23; \
				break; \
			case 24: \
				(*ptr) = regs->REG.bit.GPIO24; \
				break; \
			case 25: \
				(*ptr) = regs->REG.bit.GPIO25; \
				break; \
			case 26: \
				(*ptr) = regs->REG.bit.GPIO26; \
				break; \
			case 27: \
				(*ptr) = regs->REG.bit.GPIO27; \
				break; \
			case 28: \
				(*ptr) = regs->REG.bit.GPIO28; \
				break; \
			case 29: \
				(*ptr) = regs->REG.bit.GPIO29; \
				break; \
			case 30: \
				(*ptr) = regs->REG.bit.GPIO30; \
				break; \
			case 31: \
				(*ptr) = regs->REG.bit.GPIO31; \
				break; \
			default: \
				break; \
		} \
	}

#define GPIOB(ptr, REG, index) \
	{ \
		switch(index) \
		{ \
			case 32: \
				(*ptr) = regs->REG.bit.GPIO32; \
				break; \
			case 33: \
				(*ptr) = regs->REG.bit.GPIO33; \
				break; \
			case 34: \
				(*ptr) = regs->REG.bit.GPIO34; \
				break; \
			case 35: \
				(*ptr) = regs->REG.bit.GPIO35; \
				break; \
			case 36: \
				(*ptr) = regs->REG.bit.GPIO36; \
				break; \
			case 37: \
				(*ptr) = regs->REG.bit.GPIO37; \
				break; \
			case 38: \
				(*ptr) = regs->REG.bit.GPIO38; \
				break; \
			case 39: \
				(*ptr) = regs->REG.bit.GPIO39; \
				break; \
			case 40: \
				(*ptr) = regs->REG.bit.GPIO40; \
				break; \
			case 41: \
				(*ptr) = regs->REG.bit.GPIO41; \
				break; \
			case 42: \
				(*ptr) = regs->REG.bit.GPIO42; \
				break; \
			case 43: \
				(*ptr) = regs->REG.bit.GPIO43; \
				break; \
			case 44: \
				(*ptr) = regs->REG.bit.GPIO44; \
				break; \
			case 45: \
				(*ptr) = regs->REG.bit.GPIO45; \
				break; \
			case 46: \
				(*ptr) = regs->REG.bit.GPIO46; \
				break; \
			case 47: \
				(*ptr) = regs->REG.bit.GPIO47; \
				break; \
			case 48: \
				(*ptr) = regs->REG.bit.GPIO48; \
				break; \
			case 49: \
				(*ptr) = regs->REG.bit.GPIO49; \
				break; \
			case 50: \
				(*ptr) = regs->REG.bit.GPIO50; \
				break; \
			case 51: \
				(*ptr) = regs->REG.bit.GPIO51; \
				break; \
			case 52: \
				(*ptr) = regs->REG.bit.GPIO52; \
				break; \
			case 53: \
				(*ptr) = regs->REG.bit.GPIO53; \
				break; \
			case 54: \
				(*ptr) = regs->REG.bit.GPIO54; \
				break; \
			case 55: \
				(*ptr) = regs->REG.bit.GPIO55; \
				break; \
			case 56: \
				(*ptr) = regs->REG.bit.GPIO56; \
				break; \
			case 57: \
				(*ptr) = regs->REG.bit.GPIO57; \
				break; \
			case 58: \
				(*ptr) = regs->REG.bit.GPIO58; \
				break; \
			case 59: \
				(*ptr) = regs->REG.bit.GPIO59; \
				break; \
			case 60: \
				(*ptr) = regs->REG.bit.GPIO60; \
				break; \
			case 61: \
				(*ptr) = regs->REG.bit.GPIO61; \
				break; \
			case 62: \
				(*ptr) = regs->REG.bit.GPIO62; \
				break; \
			case 63: \
				(*ptr) = regs->REG.bit.GPIO63; \
				break; \
			default: \
				break; \
		} \
	}

#define GPIOC(ptr, REG, index) \
	{ \
		switch(index) \
		{ \
			case 64: \
				(*ptr) = regs->REG.bit.GPIO64; \
				break; \
			case 65: \
				(*ptr) = regs->REG.bit.GPIO65; \
				break; \
			case 66: \
				(*ptr) = regs->REG.bit.GPIO66; \
				break; \
			case 67: \
				(*ptr) = regs->REG.bit.GPIO67; \
				break; \
			case 68: \
				(*ptr) = regs->REG.bit.GPIO68; \
				break; \
			case 69: \
				(*ptr) = regs->REG.bit.GPIO69; \
				break; \
			case 70: \
				(*ptr) = regs->REG.bit.GPIO70; \
				break; \
			case 71: \
				(*ptr) = regs->REG.bit.GPIO71; \
				break; \
			case 72: \
				(*ptr) = regs->REG.bit.GPIO72; \
				break; \
			case 73: \
				(*ptr) = regs->REG.bit.GPIO73; \
				break; \
			case 74: \
				(*ptr) = regs->REG.bit.GPIO74; \
				break; \
			case 75: \
				(*ptr) = regs->REG.bit.GPIO75; \
				break; \
			case 76: \
				(*ptr) = regs->REG.bit.GPIO76; \
				break; \
			case 77: \
				(*ptr) = regs->REG.bit.GPIO77; \
				break; \
			case 78: \
				(*ptr) = regs->REG.bit.GPIO78; \
				break; \
			case 79: \
				(*ptr) = regs->REG.bit.GPIO79; \
				break; \
			case 80: \
				(*ptr) = regs->REG.bit.GPIO80; \
				break; \
			case 81: \
				(*ptr) = regs->REG.bit.GPIO81; \
				break; \
			case 82: \
				(*ptr) = regs->REG.bit.GPIO82; \
				break; \
			case 83: \
				(*ptr) = regs->REG.bit.GPIO83; \
				break; \
			case 84: \
				(*ptr) = regs->REG.bit.GPIO84; \
				break; \
			case 85: \
				(*ptr) = regs->REG.bit.GPIO85; \
				break; \
			case 86: \
				(*ptr) = regs->REG.bit.GPIO86; \
				break; \
			case 87: \
				(*ptr) = regs->REG.bit.GPIO87; \
				break; \
			default: \
				break; \
		} \
	}

//----------------------------------------------------
//
#define GPIOA_WR(ptr, REG, index) \
	{ \
		switch(index) \
		{ \
			case 0: \
				 regs->REG.bit.GPIO0 = (*ptr); \
				break; \
			case 1: \
				regs->REG.bit.GPIO1 = (*ptr); \
				break; \
			case 2: \
				regs->REG.bit.GPIO2 = (*ptr); \
				break; \
			case 3: \
				regs->REG.bit.GPIO3 = (*ptr); \
				break; \
			case 4: \
				regs->REG.bit.GPIO4 = (*ptr); \
				break; \
			case 5: \
				regs->REG.bit.GPIO5 = (*ptr); \
				break; \
			case 6: \
				regs->REG.bit.GPIO6 = (*ptr); \
				break; \
			case 7: \
				regs->REG.bit.GPIO7 = (*ptr); \
				break; \
			case 8: \
				regs->REG.bit.GPIO8 = (*ptr); \
				break; \
			case 9: \
				regs->REG.bit.GPIO9 = (*ptr); \
				break; \
			case 10: \
				regs->REG.bit.GPIO10 = (*ptr); \
				break; \
			case 11: \
				regs->REG.bit.GPIO11 = (*ptr); \
				break; \
			case 12: \
				regs->REG.bit.GPIO12 = (*ptr); \
				break; \
			case 13: \
				regs->REG.bit.GPIO13 = (*ptr); \
				break; \
			case 14: \
				regs->REG.bit.GPIO14 = (*ptr); \
				break; \
			case 15: \
				regs->REG.bit.GPIO15 = (*ptr); \
				break; \
			case 16: \
				regs->REG.bit.GPIO16 = (*ptr); \
				break; \
			case 17: \
				regs->REG.bit.GPIO17 = (*ptr); \
				break; \
			case 18: \
				regs->REG.bit.GPIO18 = (*ptr); \
				break; \
			case 19: \
				regs->REG.bit.GPIO19 = (*ptr); \
				break; \
			case 20: \
				regs->REG.bit.GPIO20 = (*ptr); \
				break; \
			case 21: \
				regs->REG.bit.GPIO21 = (*ptr); \
				break; \
			case 22: \
				regs->REG.bit.GPIO22 = (*ptr); \
				break; \
			case 23: \
				regs->REG.bit.GPIO23 = (*ptr); \
				break; \
			case 24: \
				regs->REG.bit.GPIO24 = (*ptr); \
				break; \
			case 25: \
				regs->REG.bit.GPIO25 = (*ptr); \
				break; \
			case 26: \
				regs->REG.bit.GPIO26 = (*ptr); \
				break; \
			case 27: \
				regs->REG.bit.GPIO27 = (*ptr); \
				break; \
			case 28: \
				regs->REG.bit.GPIO28 = (*ptr); \
				break; \
			case 29: \
				regs->REG.bit.GPIO29 = (*ptr); \
				break; \
			case 30: \
				regs->REG.bit.GPIO30 = (*ptr); \
				break; \
			case 31: \
				regs->REG.bit.GPIO31 = (*ptr); \
				break; \
			default: \
				break; \
		} \
	}

#define GPIOB_WR(ptr, REG, index) \
	{ \
		switch(index) \
		{ \
			case 32: \
				regs->REG.bit.GPIO32 = (*ptr); \
				break; \
			case 33: \
				regs->REG.bit.GPIO33 = (*ptr); \
				break; \
			case 34: \
				regs->REG.bit.GPIO34 = (*ptr); \
				break; \
			case 35: \
				regs->REG.bit.GPIO35 = (*ptr); \
				break; \
			case 36: \
				regs->REG.bit.GPIO36 = (*ptr); \
				break; \
			case 37: \
				regs->REG.bit.GPIO37 = (*ptr); \
				break; \
			case 38: \
				regs->REG.bit.GPIO38 = (*ptr); \
				break; \
			case 39: \
				regs->REG.bit.GPIO39 = (*ptr); \
				break; \
			case 40: \
				regs->REG.bit.GPIO40 = (*ptr); \
				break; \
			case 41: \
				regs->REG.bit.GPIO41 = (*ptr); \
				break; \
			case 42: \
				regs->REG.bit.GPIO42 = (*ptr); \
				break; \
			case 43: \
				regs->REG.bit.GPIO43 = (*ptr); \
				break; \
			case 44: \
				regs->REG.bit.GPIO44 = (*ptr); \
				break; \
			case 45: \
				regs->REG.bit.GPIO45 = (*ptr); \
				break; \
			case 46: \
				regs->REG.bit.GPIO46 = (*ptr); \
				break; \
			case 47: \
				regs->REG.bit.GPIO47 = (*ptr); \
				break; \
			case 48: \
				regs->REG.bit.GPIO48 = (*ptr); \
				break; \
			case 49: \
				regs->REG.bit.GPIO49 = (*ptr); \
				break; \
			case 50: \
				regs->REG.bit.GPIO50 = (*ptr); \
				break; \
			case 51: \
				regs->REG.bit.GPIO51 = (*ptr); \
				break; \
			case 52: \
				regs->REG.bit.GPIO52 = (*ptr); \
				break; \
			case 53: \
				regs->REG.bit.GPIO53 = (*ptr); \
				break; \
			case 54: \
				regs->REG.bit.GPIO54 = (*ptr); \
				break; \
			case 55: \
				regs->REG.bit.GPIO55 = (*ptr); \
				break; \
			case 56: \
				regs->REG.bit.GPIO56 = (*ptr); \
				break; \
			case 57: \
				regs->REG.bit.GPIO57 = (*ptr); \
				break; \
			case 58: \
				regs->REG.bit.GPIO58 = (*ptr); \
				break; \
			case 59: \
				regs->REG.bit.GPIO59 = (*ptr); \
				break; \
			case 60: \
				regs->REG.bit.GPIO60 = (*ptr); \
				break; \
			case 61: \
				regs->REG.bit.GPIO61 = (*ptr); \
				break; \
			case 62: \
				regs->REG.bit.GPIO62 = (*ptr); \
				break; \
			case 63: \
				regs->REG.bit.GPIO63 = (*ptr); \
				break; \
			default: \
				break; \
		} \
	}

#define GPIOC_WR(ptr, REG, index) \
	{ \
		switch(index) \
		{ \
			case 64: \
				regs->REG.bit.GPIO64 = (*ptr); \
				break; \
			case 65: \
				regs->REG.bit.GPIO65 = (*ptr); \
				break; \
			case 66: \
				regs->REG.bit.GPIO66 = (*ptr); \
				break; \
			case 67: \
				regs->REG.bit.GPIO67 = (*ptr); \
				break; \
			case 68: \
				regs->REG.bit.GPIO68 = (*ptr); \
				break; \
			case 69: \
				regs->REG.bit.GPIO69 = (*ptr); \
				break; \
			case 70: \
				regs->REG.bit.GPIO70 = (*ptr); \
				break; \
			case 71: \
				regs->REG.bit.GPIO71 = (*ptr); \
				break; \
			case 72: \
				regs->REG.bit.GPIO72 = (*ptr); \
				break; \
			case 73: \
				regs->REG.bit.GPIO73 = (*ptr); \
				break; \
			case 74: \
				regs->REG.bit.GPIO74 = (*ptr); \
				break; \
			case 75: \
				regs->REG.bit.GPIO75 = (*ptr); \
				break; \
			case 76: \
				regs->REG.bit.GPIO76 = (*ptr); \
				break; \
			case 77: \
				regs->REG.bit.GPIO77 = (*ptr); \
				break; \
			case 78: \
				regs->REG.bit.GPIO78 = (*ptr); \
				break; \
			case 79: \
				regs->REG.bit.GPIO79 = (*ptr); \
				break; \
			case 80: \
				regs->REG.bit.GPIO80 = (*ptr); \
				break; \
			case 81: \
				regs->REG.bit.GPIO81 = (*ptr); \
				break; \
			case 82: \
				regs->REG.bit.GPIO82 = (*ptr); \
				break; \
			case 83: \
				regs->REG.bit.GPIO83 = (*ptr); \
				break; \
			case 84: \
				regs->REG.bit.GPIO84 = (*ptr); \
				break; \
			case 85: \
				regs->REG.bit.GPIO85 = (*ptr); \
				break; \
			case 86: \
				regs->REG.bit.GPIO86 = (*ptr); \
				break; \
			case 87: \
				regs->REG.bit.GPIO87 = (*ptr); \
				break; \
			default: \
				break; \
		} \
	}

#define OUTOFRANGE (-1)

// electrical character of pins */
typedef enum pin_type {
	INPUT = 0,
	OUTPUT,
} pin_type_t;

#endif
